# Data Exploration

### Spaceship Titanic

Welcome to the year 2912, where your data science skills are needed to solve a cosmic mystery. We've received a transmission from four lightyears away and things aren't looking good.

The Spaceship Titanic was an interstellar passenger liner launched a month ago. With almost 13,000 passengers on board, the vessel set out on its maiden voyage transporting emigrants from our solar system to three newly habitable exoplanets orbiting nearby stars.

While rounding Alpha Centauri en route to its first destination—the torrid 55 Cancri E—the unwary Spaceship Titanic collided with a spacetime anomaly hidden within a dust cloud. Sadly, it met a similar fate as its namesake from 1000 years before. Though the ship stayed intact, almost half of the passengers were transported to an alternate dimension!

<img height="320px" width="404px" src="https://storage.googleapis.com/kaggle-media/competitions/Spaceship%20Titanic/joel-filipe-QwoNAhbmLLo-unsplash.jpg">

To help rescue crews and retrieve the lost passengers, you are challenged to predict which passengers were transported by the anomaly using records recovered from the spaceship’s damaged computer system.

Help save them and change history!

#### Spanish 3 and 4 parraf

Mientras rodeaba Alpha Centauri en ruta hacia su primer destino, el tórrido 55 Cancri E, la desprevenida nave espacial Titanic chocó con una anomalía del espacio-tiempo escondida dentro de una nube de polvo. Lamentablemente, tuvo un destino similar al de su homónimo de 1000 años antes. Aunque la nave permaneció intacta, ¡casi la mitad de los pasajeros fueron transportados a una dimensión alternativa!

Para ayudar a las tripulaciones de rescate y recuperar a los pasajeros perdidos, debe predecir qué pasajeros fueron transportados por la anomalía utilizando los registros recuperados del sistema informático dañado de la nave espacial.

¡Ayuda a salvarlos y cambia la historia!

In [81]:
#Librarys

import os
import pandas as pd
from pathlib import Path
import numpy as np

In [82]:

#Get Data

root_dir=Path(".").resolve().parent
filename='sample_submission.csv'
pathfile=os.path.join(root_dir,'data','raw',filename)
filename1='test.csv'
pathfile1=os.path.join(root_dir,'data','raw',filename1)
filename2='train.csv'
pathfile2=os.path.join(root_dir,'data','raw',filename2)

df=pd.read_csv(pathfile)
df1=pd.read_csv(pathfile1)
df2=pd.read_csv(pathfile2)

In [83]:
df.head(2)

  PassengerId  Transported
0     0013_01        False
1     0018_01        False

In [84]:
df1.head(2)

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name
0,0013_01,Earth,True,G/3/S,TRAPPIST-1e,27.0,False,0.0,0.0,0.0,0.0,0.0,Nelly Carsoning
1,0018_01,Earth,False,F/4/S,TRAPPIST-1e,19.0,False,0.0,9.0,0.0,2823.0,0.0,Lerome Peckers

In [85]:
df2.head(2)

,PassengerId,HomePlanet,CryoSleep,Cabin,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name,Transported
0,0001_01,Europa,False,B/0/P,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,Maham Ofracculy,False
1,0002_01,Earth,False,F/0/S,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,Juanna Vines,True

In [86]:
print("Shape_df:",df.shape)
print("Shape_df1:",df1.shape)
print("Shape_df2:",df2.shape)

Shape_df: (4277, 2)
Shape_df1: (4277, 13)
Shape_df2: (8693, 14)

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4277 entries, 0 to 4276
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  4277 non-null   object
 1   Transported  4277 non-null   bool
dtypes: bool(1), object(1)
memory usage: 37.7+ KB

In [88]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4277 entries, 0 to 4276
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   4277 non-null   object
 1   HomePlanet    4190 non-null   object
 2   CryoSleep     4184 non-null   object
 3   Cabin         4177 non-null   object
 4   Destination   4185 non-null   object
 5   Age           4186 non-null   float64
 6   VIP           4184 non-null   object
 7   RoomService   4195 non-null   float64
 8   FoodCourt     4171 non-null   float64
 9   ShoppingMall  4179 non-null   float64
 10  Spa           4176 non-null   float64
 11  VRDeck        4197 non-null   float64
 12  Name          4183 non-null   object
dtypes: float64(6), object(7)
memory usage: 434.5+ KB

In [89]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8693 entries, 0 to 8692
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   8693 non-null   object
 1   HomePlanet    8492 non-null   object
 2   CryoSleep     8476 non-null   object
 3   Cabin         8494 non-null   object
 4   Destination   8511 non-null   object
 5   Age           8514 non-null   float64
 6   VIP           8490 non-null   object
 7   RoomService   8512 non-null   float64
 8   FoodCourt     8510 non-null   float64
 9   ShoppingMall  8485 non-null   float64
 10  Spa           8510 non-null   float64
 11  VRDeck        8505 non-null   float64
 12  Name          8493 non-null   object
 13  Transported   8693 non-null   bool
dtypes: bool(1), float64(6), object(7)
memory usage: 891.5+ KB

In [90]:
df2.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8514.000000,8512.000000,8510.000000,8485.000000,8510.000000,8505.000000
mean,28.827930,224.687617,458.077203,173.729169,311.138778,304.854791
std,14.489021,666.717663,1611.489240,604.696458,1136.705535,1145.717189
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,76.000000,27.000000,59.000000,46.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [91]:
col=df2.describe().columns
for i in col:
    print(f'Columna {i}: ''\n',df2[i].isna().value_counts())

Columna Age:
 False    8514
True      179
Name: Age, dtype: int64
Columna RoomService:
 False    8512
True      181
Name: RoomService, dtype: int64
Columna FoodCourt:
 False    8510
True      183
Name: FoodCourt, dtype: int64
Columna ShoppingMall:
 False    8485
True      208
Name: ShoppingMall, dtype: int64
Columna Spa:
 False    8510
True      183
Name: Spa, dtype: int64
Columna VRDeck:
 False    8505
True      188
Name: VRDeck, dtype: int64

In [92]:
for i in col:
    mean=np.mean(df2[i])
    df2[i].fillna(mean,inplace=True)
    print(f'Columna {i}: ''\n',df2[i].isna().value_counts())

Columna Age:
 False    8693
Name: Age, dtype: int64
Columna RoomService:
 False    8693
Name: RoomService, dtype: int64
Columna FoodCourt:
 False    8693
Name: FoodCourt, dtype: int64
Columna ShoppingMall:
 False    8693
Name: ShoppingMall, dtype: int64
Columna Spa:
 False    8693
Name: Spa, dtype: int64
Columna VRDeck:
 False    8693
Name: VRDeck, dtype: int64

In [93]:
df2['Age'].isna().value_counts()

False    8693
Name: Age, dtype: int64

In [94]:
agemean=np.mean(df2['Age'])
df2['Age'].fillna(agemean,inplace=True)

In [95]:
df2['Age'].isna().value_counts()

False    8693
Name: Age, dtype: int64

In [96]:
df2['RoomService'].isna().value_counts()

False    8693
Name: RoomService, dtype: int64

In [97]:
Rmean=np.mean(df2['RoomService'])
df2['RoomService'].fillna(Rmean,inplace=True)
df2['RoomService'].isna().value_counts()

False    8693
Name: RoomService, dtype: int64

In [98]:
Rmean=np.mean(df2['FoodCourt'])
df2['FoodCourt'].fillna(Rmean,inplace=True)
df2['FoodCourt'].isna().value_counts()

False    8693
Name: FoodCourt, dtype: int64

In [99]:
Rmean=np.mean(df2['ShoppingMall'])
df2['ShoppingMall'].fillna(Rmean,inplace=True)
df2['ShoppingMall'].isna().value_counts()

False    8693
Name: ShoppingMall, dtype: int64

In [100]:
Rmean=np.mean(df2['Spa'])
df2['Spa'].fillna(Rmean,inplace=True)
df2['Spa'].isna().value_counts()

False    8693
Name: Spa, dtype: int64

In [101]:
Rmean=np.mean(df2['VRDeck'])
df2['VRDeck'].fillna(Rmean,inplace=True)
df2['VRDeck'].isna().value_counts()

False    8693
Name: VRDeck, dtype: int64